In [ ]:
#  Before the cells below are run, please poetry install and run 'poetry run python -m ipykernel install --user --name=$(basename "$PWD")'. 
#  Then select the kernel named after the current directory in the top right corner of this notebook.

In [20]:
import configparser

config = configparser.ConfigParser()
config.read('config.ini')

if 'DEFAULT' in config and 'database' in config['DEFAULT']:
    print('yes')
    db_name = config['DEFAULT']['database']
else:
    db_name = 'practice.db'

yes

In [39]:
%load_ext sql
%sql sqlite:///practice.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [2]:
# reload / load the sql magic and set a compatible style
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql sqlite:///practice.db

In [29]:
%%sql 
  PRAGMA foreign_keys = ON;
  --  Departments
  CREATE TABLE IF NOT EXISTS departments (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL
);

--  Employees
  CREATE TABLE IF NOT EXISTS employees (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    dept_id INTEGER,
    salary INTEGER,
    hire_date TEXT,
    FOREIGN KEY(dept_id) REFERENCES departments(id)
);

--  Customers
  CREATE TABLE IF NOT EXISTS customers (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    city TEXT
);

--  Products
  CREATE TABLE IF NOT EXISTS products (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    category TEXT,
    price REAL
);

--  Orders
CREATE TABLE IF NOT EXISTS orders (
  id INTEGER PRIMARY KEY,
  customer_id INTEGER,
  order_date TEXT,
total REAL,
  FOREIGN KEY(customer_id) REFERENCES customers(id)
);

--  Order items
CREATE TABLE IF NOT EXISTS order_items (
  id INTEGER PRIMARY KEY,
  order_id INTEGER,
  product_id INTEGER,
  quantity INTEGER,
  unit_price REAL,
  FOREIGN KEY(order_id) REFERENCES orders(id),
  FOREIGN KEY(product_id) REFERENCES products(id)
);

--  Seed departments
INSERT OR IGNORE INTO departments (id, name) VALUES
(1, 'Engineering'),
(2, 'Sales'),
(3, 'HR');

--  Seed employees
INSERT OR IGNORE INTO employees (id, name, dept_id, salary, hire_date) VALUES
(1, 'Alice', 1, 90000, '2018-03-21'),
(2, 'Bob', 1, 80000, '2019-07-15'),
(3, 'Charlie', 2, 65000, '2020-01-10'),
(4, 'Dana', 3, 70000, '2017-09-05'),
(5, 'Eve', NULL, 72000, '2021-11-23');

--  Seed customers
INSERT OR IGNORE INTO customers (id, name, city) VALUES
(1, 'Acme Corp', 'London'),
(2, 'Bright Co', 'Berlin'),
(3, 'Cafe 123', 'Paris');

--  Seed products
INSERT OR IGNORE INTO products (id, name, category, price) VALUES
(1, 'Laptop', 'Electronics', 1200.0),
(2, 'Mouse', 'Electronics', 25.0),
(3, 'Mug', 'Home', 8.5),
(4, 'Notebook', 'Stationery', 3.5);

--  Seed orders
INSERT OR IGNORE INTO orders (id, customer_id, order_date, total) VALUES
  (1, 1, '2023-05-01', 1225.0),
  (2, 3, '2023-05-03', 11.0),
  (3, 2, '2023-06-15', 2400.0);
  
--  Seed order_items
INSERT OR IGNORE INTO order_items (id, order_id, product_id, quantity,
  unit_price) VALUES
  (1, 1, 1, 1, 1200.0),
  (2, 1, 2, 1, 25.0),
  (3, 2, 3, 1, 8.5),
  (4, 3, 1, 2, 1200.0);

 * sqlite:///practice.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [1]:
%%sql
SELECT 'ok' AS status;

UsageError: Cell magic `%%sql` not found.

In [3]:
%%sql

SELECT * FROM customers;

 * sqlite:///practice.db
Done.

[(1, 'Acme Corp', 'London'),
 (2, 'Bright Co', 'Berlin'),
 (3, 'Cafe 123', 'Paris')]

In [4]:
%%sql

SELECT * FROM orders;

 * sqlite:///practice.db
Done.

[(1, 1, '2023-05-01', 1225.0),
 (2, 3, '2023-05-03', 11.0),
 (3, 2, '2023-06-15', 2400.0)]

In [5]:
%%sql
SELECT * FROM products;

 * sqlite:///practice.db
Done.

[(1, 'Laptop', 'Electronics', 1200.0),
 (2, 'Mouse', 'Electronics', 25.0),
 (3, 'Mug', 'Home', 8.5),
 (4, 'Notebook', 'Stationery', 3.5)]

In [6]:
%%sql
SELECT * FROM order_items;

 * sqlite:///practice.db
Done.

[(1, 1, 1, 1, 1200.0),
 (2, 1, 2, 1, 25.0),
 (3, 2, 3, 1, 8.5),
 (4, 3, 1, 2, 1200.0)]

In [7]:
%%sql
SELECT * FROM employees;

 * sqlite:///practice.db
Done.

[(1, 'Alice', 1, 90000, '2018-03-21'),
 (2, 'Bob', 1, 80000, '2019-07-15'),
 (3, 'Charlie', 2, 65000, '2020-01-10'),
 (4, 'Dana', 3, 70000, '2017-09-05'),
 (5, 'Eve', None, 72000, '2021-11-23')]

In [8]:
%%sql
SELECT * FROM departments;

 * sqlite:///practice.db
Done.

[(1, 'Engineering'), (2, 'Sales'), (3, 'HR')]